chgpalmer/nrf9151-tracker/apps/tracker/src/main.c
/*
 * nRF9151 GPS tracker — active mode
 *
 * loc_fsm decides who gets the shared radio (GNSS vs LTE) and what to publish;
 * this file executes that policy: modem bring-up and the publish loop. Reports
 * go as protobuf (proto/tracker.proto, encoders generated by nanopb) in
 * non-confirmable CoAP POSTs over UDP — fire-and-forget like the old MQTT
 * QoS 0, but ~4x cheaper on air and with no TCP ACK tail holding RRC open.
 * LTE registers once at boot and stays registered — PSM parks the radio between
 * sends, which is what gives GNSS its acquisition windows.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <math.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <nrf_modem_gnss.h>
#include <nrf_modem_at.h>
#include <modem/nrf_modem_lib.h>
#include <modem/lte_lc.h>
#include <hw_id.h>

#include "loc_fsm.h"
#include "motion.h"
#include "agnss.h"
#include "coap_pub.h"
#include "obs_queue.h"
#include "uplink.h"
#include "log_uplink.h"
#include "leds.h"

LOG_MODULE_REGISTER(tracker, CONFIG_TRACKER_LOG_LEVEL);

/* ── configuration ──────────────────────────────────────────────── */
#define SERVER_HOST       CONFIG_TRACKER_SERVER_HOST
#define SERVER_PORT       CONFIG_TRACKER_SERVER_PORT

#define GNSS_INTERVAL_S   1   /* PVT event rate in continuous mode */
/* In periodic mode, how long each check may hunt before giving up and
 * sleeping. Bounds the awake time (the whole point of periodic mode); a hot
 * start needs 1-3 s, so 30 s also covers a warm start without burning
 * minutes indoors where no fix is coming. */
#define GNSS_CHECK_RETRY_S 30
#define POST_INTERVAL_MS  (CONFIG_TRACKER_POST_INTERVAL_S * 1000)
#define STATUS_INTERVAL_MS 5000
/* GPS staleness now lives in loc_fsm, which owns the fix bookkeeping. */
#define NET_RETRY_MS      10000  /* between socket-setup attempts */
/* Flush cadence and all other send policy live in uplink now. */

/* RSRP index → dBm (same formula as modem_info.h RSRP_IDX_TO_DBM). */
#define RSRP_IDX_TO_DBM(idx) ((idx) < 0 ? (idx) - 140 : (idx) - 141)

/* Serving-cell identity, parsed from AT%XMONITOR (cached registration data —
 * no radio scan). Enough for an OpenCelliD single-cell lookup. */
struct serving_cell {
	int      mcc;
	int      mnc;
	uint32_t tac;
	uint32_t cid;
	int      rsrp_dbm;
	int      band;
	char     op[32];
	bool     valid;
};

/* ── state ───────────────────────────────────────────────────────── */
static struct nrf_modem_gnss_pvt_data_frame pvt;
static K_SEM_DEFINE(pvt_sem, 0, 1);

static enum lte_lc_nw_reg_status lte_status = LTE_LC_NW_REG_NOT_REGISTERED;
/* Set from the LTE callback thread, polled by the main loop. */
static volatile bool lte_connected;

/* Registration (lte_connected) is NOT the same as having an active default
 * PDN with an assigned IP; sockets and DNS only work once the PDN is up, so
 * socket setup gates on this. On native_sim CONFIG_LTE_LC_PDN_MODULE is off
 * (host sockets are always up), so default to true there. */
#if defined(CONFIG_LTE_LC_PDN_MODULE)
static volatile bool pdn_active;
#else
static volatile bool pdn_active = true;
#endif

/* GNSS only runs when LTE leaves the radio alone, so the two facts that explain
 * a starved GNSS are whether we are stuck in RRC connected and whether the
 * network actually granted PSM. Both are set from the LTE callback thread. */
static volatile bool rrc_connected;
static volatile int  psm_tau_s    = -1;
static volatile int  psm_active_s = -1; /* -1 = PSM not granted */

/* When the last publish went out. The LTE handler uses it to log how long RRC
 * stayed connected after we finished sending -- the tail RAI should shrink. */
static volatile int64_t last_pub_ms;

static char device_id[HW_ID_LEN];

/* ── GNSS ─────────────────────────────────────────────────────────  */
/* Set by EVT_BLOCKED/UNBLOCKED; the handler runs in ISR context, so it only
 * flags the change and the main loop logs the edge. */
static volatile bool gnss_blocked;

static void gnss_handler(int event)
{
	switch (event) {
	case NRF_MODEM_GNSS_EVT_PVT:
		if (nrf_modem_gnss_read(&pvt, sizeof(pvt),
					NRF_MODEM_GNSS_DATA_PVT) == 0) {
			k_sem_give(&pvt_sem);
		}
		break;
	case NRF_MODEM_GNSS_EVT_BLOCKED:
		gnss_blocked = true;
		break;
	case NRF_MODEM_GNSS_EVT_UNBLOCKED:
		gnss_blocked = false;
		break;
	default:
		break;
	}
}

/* Set up GNSS without starting it: loc_fsm decides when it may run. */
static int gnss_configure(void)
{
	int err;

	err = nrf_modem_gnss_event_handler_set(gnss_handler);
	if (err) {
		LOG_ERR("gnss event handler: %d", err);
		return err;
	}

	uint16_t nmea_mask = 0; /* no NMEA — we use PVT only */
	nrf_modem_gnss_nmea_mask_set(nmea_mask);

	nrf_modem_gnss_fix_interval_set(GNSS_INTERVAL_S);
	nrf_modem_gnss_fix_retry_set(0); /* run continuously */

	uint8_t use_case = NRF_MODEM_GNSS_USE_CASE_MULTIPLE_HOT_START;
	nrf_modem_gnss_use_case_set(use_case);

	return 0;
}

static int gnss_start(void)
{
	int err = nrf_modem_gnss_start();

	if (err) {
		LOG_ERR("gnss start: %d", err);
	}
	return err;
}

/* ── LTE ──────────────────────────────────────────────────────────  */
static void lte_handler(const struct lte_lc_evt *const evt)
{
	switch (evt->type) {
	case LTE_LC_EVT_NW_REG_STATUS: {
		/* The searching EDGE splits the attach time: boot->searching is
		 * modem init, searching->registered is scan + PLMN walk +
		 * registration — the part band memory can shrink. One INF per
		 * episode. */
		static enum lte_lc_nw_reg_status prev_status =
			LTE_LC_NW_REG_NOT_REGISTERED;

		if (evt->nw_reg_status == LTE_LC_NW_REG_SEARCHING &&
		    prev_status != LTE_LC_NW_REG_SEARCHING) {
			LOG_INF("LTE: searching");
		}
		prev_status = evt->nw_reg_status;
		lte_status = evt->nw_reg_status;
		if (lte_status == LTE_LC_NW_REG_REGISTERED_HOME ||
		    lte_status == LTE_LC_NW_REG_REGISTERED_ROAMING) {
			LOG_INF("LTE registered (%s)",
				lte_status == LTE_LC_NW_REG_REGISTERED_ROAMING
					? "roaming" : "home");
			lte_connected = true;
		} else {
			lte_connected = false;
		}
		break;
	}
	case LTE_LC_EVT_PSM_UPDATE:
		/* active_time == -1 means the network refused PSM. Roaming networks
		 * often do. Without PSM the modem keeps monitoring pagings and GNSS
		 * never gets a long enough window for a cold start. Log at INF: this
		 * was LOG_DBG and therefore invisible at CONFIG_TRACKER_LOG_LEVEL=3. */
		psm_tau_s    = evt->psm_cfg.tau;
		psm_active_s = evt->psm_cfg.active_time;
		if (psm_active_s < 0) {
			LOG_WRN("PSM: NOT granted by network (TAU %d)", psm_tau_s);
		} else {
			LOG_INF("PSM: granted — TAU %d s, active %d s",
				psm_tau_s, psm_active_s);
		}
		break;
#if defined(CONFIG_LTE_LC_PDN_MODULE)
	case LTE_LC_EVT_PDN:
		/* Default-context (CID 0) activation is when we actually have
		 * an IP and sockets can be created. */
		if (evt->pdn.cid == 0) {
			if (evt->pdn.type == LTE_LC_EVT_PDN_ACTIVATED) {
				pdn_active = true;
				LOG_INF("PDN: default context active (IP up)");
			} else if (evt->pdn.type == LTE_LC_EVT_PDN_DEACTIVATED) {
				pdn_active = false;
				LOG_WRN("PDN: default context down");
			}
		}
		break;
#endif
	case LTE_LC_EVT_RRC_UPDATE:
		rrc_connected = (evt->rrc_mode == LTE_LC_RRC_MODE_CONNECTED);
		if (rrc_connected) {
			LOG_DBG("RRC: connected (GNSS blocked)");
		} else {
			/* The tail between our last publish and RRC release is
			 * radio time GNSS cannot use. RAI exists to shrink it;
			 * this delta is the measurement of whether it works. */
			int64_t tail = k_uptime_get() - last_pub_ms;

			if (last_pub_ms > 0 && tail < 30000) {
				LOG_DBG("RRC: idle (%lld ms after publish)",
					(long long)tail);
			} else {
				LOG_DBG("RRC: idle");
			}
		}
		break;
	default:
		break;
	}
}

static const char *lte_status_str(void)
{
	switch (lte_status) {
	case LTE_LC_NW_REG_NOT_REGISTERED:       return "not registered";
	case LTE_LC_NW_REG_REGISTERED_HOME:      return "registered (home)";
	case LTE_LC_NW_REG_SEARCHING:            return "searching";
	case LTE_LC_NW_REG_REGISTRATION_DENIED:  return "denied";
	case LTE_LC_NW_REG_UNKNOWN:              return "no coverage";
	case LTE_LC_NW_REG_REGISTERED_ROAMING:   return "registered (roaming)";
	default:                                  return "?";
	}
}

